[
    {
        "title": "Bike Goggles",
        "year": "2025",
        "url": "https://praveendesharma.github.io/bikegoggles/",
        "image": "../projects/images/bike-goggles.png",
        "description": "I created an interactive map using mapbox and d3 that allows users to visulaize bike lanes and traffic at various times of the day in Boston and Cambridge, MA."
    },
    {
        "title": "Mindful Metrics",
        "year": "2025",
        "url": "https://praveendesharma.github.io/meditation-trends/",
        "image": "../projects/images/meditation-viz.png",
        "description": "Built an interactive data visualization tool that allows users to compares changes in heart rate across various meditation techniques against normal and athlete baseline readings."
    },
    {
        "title": "Deceptive Visualizations",
        "year": "2025",
        "url": "https://praveendesharma.github.io/dsc106-project2/",
        "image": "../projects/images/deceptive-viz.png",
        "description": "I created a pair of visualizations, one arguing for and the other agaisnt the proposition that black complainants are disproportionately involved in repeat incidents with the same police officers using NYPD police complaints data."
    },
    {
        "title": "Grocery Pricing Analysis",
        "year": "2025",
        "image": "../projects/images/grocery-viz.png",
        "description": "Compared pricing and nutritional content of food products across major retailers like Whole Foods, Walmart, and Target."
    },
    {
        "title": "Power Outage Predictions",
        "year": "2025",
        "url": "https://chinmayb1.github.io/power-outage-project/",
        "image": "../projects/images/outage-viz.png",
        "description": "Explored the relationship between the different classifications of regions and outage duration, and developed a machine learning model to develop a prediction system."
    },
    {
        "title": "UCSD Enrollment Prediction",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Predicted open seats in UCSD courses using enrollment data, capacity, fill rate, and class standing with machine learning techniques."
    },
    {
        "title": "MTS Network Analysis",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Analyzed bus arrival times using Poisson processes, including the Waiting Time Paradox, and visualized real-world transit data."
    },
    {
        "title": "N-Gram Language Model",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built a text generation model using N-Gram probabilities, improving sentence coherence and reducing perplexity."
    },
    {
        "title": "Multiproduction Trade Credit Research",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Explored firm networks and trade credit flows in multi-production settings for an economics research project."
    },
    {
        "title": "Officiis debitis repellendus ipsam.",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Veritatis deserunt doloremque debitis velit officia repellendus eaque veniam natus illo architecto saepe perferendis, quasi dolores magnam. Repudiandae illum ex mollitia eius itaque sunt, iure ipsa illo rem, autem sit."
    },
    {
        "title": "Laboriosam ex eveniet recusandae?",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Inventore odit fugit consequuntur vitae voluptas a quod asperiores quam, nisi id doloribus, aspernatur eos tempore quos? Accusantium laudantium maxime vel, perferendis, impedit esse error deleniti sed non nihil voluptatum."
    },
    {
        "title": "Fuga dolorem debitis quod!",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Doloribus possimus totam voluptates culpa expedita, debitis distinctio provident aspernatur. Sapiente minus quas totam, dignissimos eius reprehenderit at fuga quia! Sit quas ea consequuntur officia modi culpa aut, vitae repellendus."
    }
]